In [25]:
import pandas as pd
import pyodbc # python object database connectivity
import warnings
import platform
import sqlalchemy, os
warnings.filterwarnings("ignore")

In [2]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'ODBC Driver 17 for SQL Server']

In [4]:
platform.node()

'DESKTOP-NAKP5E5'

* driver
* host
* database
* trusted_connection

In [5]:
# establish the connect between python and sql
connection = pyodbc.connect(driver = '{ODBC Driver 17 for SQL Server}',
                           host = platform.node(),
                           database = 'upGrad_2023',
                           trusted_connection='yes')

In [6]:
connection

In [7]:
# Reading the data from employeedb table from upGrad_2023 from ssms

In [35]:
sql_query = "Select * from EmployeeDB"

In [36]:
df = pd.read_sql(sql = sql_query, con = connection)

In [37]:
df.shape

(20, 10)

In [20]:
df

,EmpID,FirstName,LastName,Education,Occupation,Grade,YearlyIncome,Sales,HireDate,DeptID
0,1870.0,Annie,Jenkins,Bachelors,Management,A,35000.0,4650.0,1899-12-30 00:00:00.000,9.0
1,9939.0,Abhisheak,Saraswat,Bachelors,Professional,A,45000.0,3805.0,1899-12-30 00:00:00.000,NaN
2,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0

In [23]:
pd.read_sql(sql="select * from employeedb",
            con = connection).to_csv("EmployeeDB.csv", index=False)

In [31]:
# How to make a connection using sqlalchemy between python and sql

In [32]:
conn = sqlalchemy.create_engine(f'mssql+pyodbc://{platform.node()}/upGrad_2023?trusted_connection=yes&driver=ODBC Driver 17 for SQL Server')

In [45]:
i = 1
for fl in os.listdir():
    if fl.startswith('EmployeeDB'):
        df = pd.read_csv(fl)
        df.to_sql("Nancy", con = conn, if_exists='append', index = False)

In [30]:
17 * 20

340

In [46]:
340*3

1020

In [47]:
# Os Tutorial

In [51]:
os.chdir(os.environ['userprofile'] + "\Desktop\Aman") # change directory

In [49]:
os.getcwd()

'C:\\Users\\AEPAC\\Desktop\\Aman'

In [50]:
os.listdir()

['Abhisheak.csv', 'Aman.csv', 'Superstore.csv']

In [53]:
df = pd.DataFrame({"  EmployeeDB  ":[101,102,103],"  EmpName  ":["A","B","C"]})

In [54]:
df

   EmployeeDB   EmpName
0           101         A
1           102         B
2           103         C

In [55]:
df.columns

Index(['  EmployeeDB  ', '  EmpName  '], dtype='object')

In [56]:
df.columns = df.columns.str.strip()

In [57]:
df.columns

Index(['EmployeeDB', 'EmpName'], dtype='object')

In [60]:
os.chdir(r"C:\Users\AEPAC\Desktop\KnowledgeHut\2024\2024_upGrad\Python\17 - 06th Oct - Python Data Cleaning and Preprocessing")
result = pd.DataFrame()
for fl in os.listdir():
    if fl.startswith('EmployeeDB'):
        df = pd.read_csv(fl)
        result = pd.concat([result,df])

In [61]:
result.shape

(340, 10)

In [62]:
result

,EmpID,FirstName,LastName,Education,Occupation,Grade,YearlyIncome,Sales,HireDate,DeptID
0,1870.0,Annie,Jenkins,Bachelors,Management,A,35000.0,4650.0,1899-12-30 00:00:00.000,9.0
1,9137.0,Sandra,Hicks,Bachelors,Clerical,D,25000.0,4449.0,1899-12-30 00:00:00.000,5.0
2,8843.0,Benjamin,Willis,Master Degree,Professional,B,50000.0,4093.0,1899-12-30 00:00:00.000,8.0
3,9939.0,Abhisheak,Saraswat,Bachelors,Professional,A,45000.0,3805.0,1899-12-30 00:00:00.000,NaN
4,6016.0,Roger,Gomez,Intermediate,Clerical,C,55000.0,3750.0,1899-12-30 00:00:00.000,6.0
...,...,...,...,...,...,...,...,...,...,...
15,8592.0,Gloria,Harper,High School,Clerical,A,40000.0,1383.0,1899-12-30 00:00:00.000,2.0
16,5711.0,Brian,Ryan,Bachelors,Clerical,A,40000.0,843.0,1899-12-30 00:00:00.000,6.0
17,4481.0,Harold,Hunter,High School,Professional,C,50000.0,523.0,1899-12-30 00:00:00.000,3.0
18,4682.0,Helen,Dean,High School,Management,B,75000.0,100.0,1899-12-30 00:00:00.000,2.0
19,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0

In [63]:
result.nlargest(5,'Sales')

,EmpID,FirstName,LastName,Education,Occupation,Grade,YearlyIncome,Sales,HireDate,DeptID
19,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0
19,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0
19,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0
19,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0
19,2220.0,Walter,Kennedy,Education,Human Resource,A,60000.0,4944.0,1899-12-30 00:00:00.000,6.0